Revit 2026 API

# StructuralAssetFailures Properties

---

The BuiltInFailuresStructuralAssetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialAssetInvalid | Material assigned to the Analytical Element does not contain Structure parameters - verify material content. |

#### Reference

BuiltInFailuresStructuralAssetFailures Class

Autodesk.Revit.DB Namespace